---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.EditingFailures
source: html/072adfe0-63f0-3613-f5a5-6c3cb4110f00.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures

Failures related to editing operations.

## Syntax (C#)
```csharp
public static class EditingFailures
```